app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 46]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 46]]
---

 <%if @user.posts.count != 0 %>

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 47]]
---
    All Post:<br>
    <% @user.posts.each do |post| %>