app/views/posts/_form.html.erb

SELECT "users".* FROM "users"
---
<%= form_for @post do |f| %>
    Select User:<%= f.collection_select :user_id, User.all, :id, :username %><br>