app/views/posts/show.html.erb


Likes: <%= @post.likes.count %> Comments: <%= @post.comments.count %><br>
----------------------------------------------<br>
<% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 10]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 17]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 17]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 17]]