app/controllers/application_controller.rb

    def home
        if session[:user_id]
            @logged_in_user = User.find(session[:user_id])
            @posts = Post.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 38], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"

    def required_login
        @errors = flash[:errors]
        if session[:user_id]
         @logged_in_user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 43], ["LIMIT", 1]]