app/controllers/comments_controller.rb

    def create
        @comment = Comment.create(content: comment_params[:content], user_id: params[:user_id], post_id: params[:post_id])
---
INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 31], ["post_id", 10], ["content", "I hope this works"], ["created_at", "2019-11-12 21:38:24.805942"], ["updated_at", "2019-11-12 21:38:24.805942"]]