app/controllers/likes_controller.rb

    def create
        @like = Like.create(like_params)
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 43], ["post_id", 13], ["created_at", "2019-11-13 17:21:57.606760"], ["updated_at", "2019-11-13 17:21:57.606760"]]