app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["content", "None Here"], ["created_at", "2019-11-11 23:47:55.735456"], ["updated_at", "2019-11-11 23:47:55.735456"]]
---
    def create
        @post = Post.create(post_params)

UPDATE "posts" SET "content" = ?, "user_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "bullts"], ["user_id", 14], ["updated_at", "2019-11-12 00:10:51.311523"], ["id", 5]]
---
    def update
        @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]
---
    def destroy
        @user = @post.user
        @post.destroy