app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def create
            @user = User.new(user_params)
            if @user.mood
                @user.img_url = Scraper.search(@user.username,@user.mood)

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def update
        old_mood = @user.mood
        old_username = @user.username
        @user.update(user_params)
        if @user.mood != old_mood || @user.username != old_username
            @user.update(img_url: Scraper.search(@user.username,@user.mood))