app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)
---
    def create
        @user = User.create(user_params)

UPDATE "users" SET "mood" = ?, "hobby" = ?, "food" = ?, "music" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["mood", "Chillen"], ["hobby", ""], ["food", "Coffee"], ["music", ""], ["updated_at", "2019-11-12 14:54:44.200885"], ["id", 22]]
---
    def update
        @user.update(user_params)