app/views/application/home.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 38], ["LIMIT", 1]]
---
<div class="row justify-content-md-center display-4">
Welcome, <%= User.find(session[:user_id]).username.capitalize%>